//
//  ZIKRegisterProtocolViewController.m
//  FLSocketIM
//
//  Created by ZIKong on 2019/3/21.
//  Copyright © 2019 冯里. All rights reserved.
//

#import "ZIKRegisterProtocolViewController.h"

@interface ZIKRegisterProtocolViewController ()
@property (weak, nonatomic) IBOutlet UITextView *textView;

@end

@implementation ZIKRegisterProtocolViewController

- (void)viewDidLoad {
    [super viewDidLoad];
    // Do any additional setup after loading the view from its nib.
    self.title = @"注册协议";
    
    self.textView.text = @"尊敬的客户您好，欢迎您使用HiChat-OnLine（以下简称：APP）。在您注册成为APP会员之前，请您务必认真阅读和理解《APP用户注册协议》（以下简称：协议）中所有的条款。您须完全同意协议中所有的条款，才可以注册成为本APP的用户，使用里面的服务。您在APP的注册和操作均将被视为是您对协议所有条款及内容的自愿接受。\n 一、声明\n（一）APP内在线产品的所有权归KongDezhi所有。\n（二）您在APP进行注册时，一旦点击“我接受”按钮，即表示为您已自愿接受协议中所有的条款和内容。（三）协议条款的效力范围仅限于\n本APP，您在APP的行为均受协议的约束。\n（四）您使用APP服务的行为，即被视为您已知悉本APP的相关公告并同意。\n（五）本APP有权在未提前通知您的情况下修改协议的条款，您每次进入APP在使用服务前，都应先查阅一遍协议。\n（六）本APP有权在未提前通知您的情况下修改、暂停APP部分或全部的服务，且不承担由此产生来自您和第三方的任何责任。\n（七）本APP提供免费注册服务，您的注册均是自愿行为，注册成功后，您可以得到APP更加完善的服务。\n（八）您注册成后账户和密码如有灭失，不会影响到您已办理成功业务的效力，本APP可恢复您的注册账户及相关信息但不承担除此以外的其它任何责任。\n二、用户管理\n（一）您在本APP的所有行为都须符合中国的法律法规，您不得利用本APP提供的服务制作、复制、发布、传播以下信息：\n 1、反对宪法基本原则的；\n 2、危害国家安全、泄露国家秘密、颠覆国家政权、破坏国家统一的；\n 3、损害国家荣誉和利益的；\n 4、煽动民族仇恨、民族歧视、破坏民族团结的；\n 5、破坏国家宗教政策，宣扬邪教和封建迷信的；\n 6、散布谣言、扰乱社会秩序、破坏社会稳定的；\n 7、散布淫秽、色情、赌博、暴力、凶杀、恐怖内容或者教唆犯罪的；\n 8、侮辱或者诽谤他人，侵害他人合法权益的；\n 9、以及法律、法规禁止的其他内容。\n（二）您在本APP的行为，还必须符合其它国家和地区的法律规定以及国际法的有关规定。\n（三）不得利用本APP从事以下活动：\n1、未经允许，进入他人计算机信息网络或者使用他人计算机信息网络的资源；\n2、未经允许，对他人计算机信息网络的功能进行删除、修改或增加；\n3、未经允许，对他人计算机信息网络中存储、处理或者传输的数据和应用程序进行删除、修改或者增加；\n4、制作、故意传播计算机病毒等破坏性程序的；\n5、其他危害计算机信息网络安全的行为。\n（四）遵守本APP其他规定和程序：\n1、您对自己在本APP中的行为和操作承担全部责任；\n2、您承担责任的形式包括但不仅限于，对受到侵害者进行赔偿、在本APP首先承担了因您的行为导致的行政处罚或侵权损害赔偿责任后，您应给予本APP的等额赔偿；\n3、如果本APP发现您传输的信息含有本协议所规定的内容，本APP有权在不通知您的情况下采取包括但不仅限于向国家有关机关报告、保存有关记录、删除该内容及链接地址、关闭服务器、暂停您账号的操作权限、停止向您提供服务等措施。\n三、注册会员权利和义务\n（一）注册会员有权用本APP提供的服务功能。\n（二）注册会员同意遵守包括但不仅限于《中华人民共和国保守国家秘密法》、《中华人民共和国计算机信息系统安全保护条例》、《计算机软件保护条例》、《互联网电子公告服务管理规定》、《互联网信息服务管理办法》等在内的法律、法规。\n（三）您注册时有义务提供完整、真实、的个人信息，信息如有变更，应及时更新。\n（四）您成为注册会员须妥善保管用户名和密码，用户登录后进行的一切活动均视为是您本人的行为和意愿，您负全部责任。\n（五）您在使用本APP服务时，同意且接受本APP提供的各类信息服务\n（六）您使用本APP时，禁止有以下行为：\n1、上载、张贴、发送电子邮件或以其他方式传送含有违反国家法律、法规的信息或资料，这些资料包括但不仅限于资讯、资料、文字、软件、音乐、照片、图形、等（下同）；\n2、散布淫秽、色情、赌博、暴力、凶杀、恐怖或者教唆犯罪的资料；\n3、冒充任何个人或机构，或以虚伪不实的方式误导他人以为其与任何人或任何机构有关；\n4、通过本APP干扰、破坏或限制他人计算机软件、硬件或通讯设备功能的行为；\n5、通过本APP跟踪或以其他方式骚扰他人。";
}


@end
